{
    "title": "Adventure Game",
    "author": "Rowan and Anna",
    "start_step": "start",
    "steps" : [
        {
            "name": "start",
            "type": "decision",
            "text": "You are a cat and you are in a bedroom in a house that you don't belong in.  The grown-ups see you.  You can't run out of the door becuase it is closed and there isn't a cat flap.  What are you going to do?",
            "opts": [
                {
                    "text": "Run and hide in the closet.",
                    "goto": "closet"
                },
                {
                    "text": "Run and hide under the bed",
                    "goto": "bed"
                }
            ]
        },{
            "name": "closet",
            "type": "decision",
            "text": "You run into the closet but you only get 10 seconds of peace before the grown up finds you.",
            "opts": [
                {
                    "text": "Run under the bed",
                    "goto": "bed"
                },
                {
                    "text": "Growl at the grown-up and try to scare them",
                    "goto": "growl"
                },
                {
                    "text": "Look at cute and furry and try to get them to stroke you.",
                    "goto": "cute"
                }
            ]
        },{
            "name": "cute",
            "type": "decision",
            "text": "The grown-ups bend down and stroke you.  You purr and rub against them as they scratch your back.  You decide to...",
            "opts": [
                {
                    "text": "Scratch them and be sick on their shoes.",
                    "goto": "sick"
                },
                {
                    "text": "Try to get them to buy you food by giving them your big bambi eyes.",
                    "goto": "bambi"
                }
            ]
        },{
            "name": "bed",
            "type": "decision",
            "text": "While you are under the bed hiding you find a slip of paper with a code on it: 51 63 142 62 45.  You wonder what it means, but then the grown up is trying to reach your tail and pull you out!",
            "opts": [
                {
                    "text": "Scratch them and be sick on their shoes.",
                    "goto": "sick"
                },
                {
                    "text": "Accept defeat and see what happens.",
                    "goto": "defeat"
                }
            ],
            "acquire" : "code - 51 63 142 62 45"
        },{
            "name": "sick",
            "type": "decision",
            "text": "The grownup looks down at their shoes and gets angry.  They shout at you.  At this moment you see the window is open and run out of it.  As you fly through the air you look for a suitable landing spot.",
            "opts": [
                {
                    "text": "On the trampolene.",
                    "goto": "trampolene"
                },
                {
                    "text": "On the grass.",
                    "goto": "grass"
                }
            ]
        },{
            "name": "bambi",
            "type": "decision",
            "text": "The grown up picks you up and you pretend to be hungry by doing your  best \"Simon's cat\" impression.  They say they want to feed you but they don't have any cat food.  You purr lots until they decide to go to the shop.  They put you down, get their keys and leave you in the house.  You decide to explore.",
            "opts": [
                {
                    "text": "Explore under the bed.",
                    "goto": "bed explore"
                },
                {
                    "text": "Explore the upstairs rooms",
                    "goto": "upstairs"
                }
            ]
        },{
            "name": "bed explore",
            "type": "forwarder",
            "text": "While you are under the bed exploring you find a slip of paper with a code on it: 51 63 142 62 45.  You wonder what it means, then go to explore the upstairs rooms",
            "goto": "upstairs",
            "acquire" : "code - 51 63 142 62 45"
        },{
            "name": "trampolene",
            "type": "decision",
            "text": "On the trampolene you find a key and wonder what it would opon so you desid to go and explor the garden.",
            "opts": [
                {
                    "text": "Go to the garage",
                    "goto": "garage"
                },
                {
                    "text": "Explore the garden",
                    "goto": "garden"
                }
            ],
            "acquire": "key"
        },{
            "name": "growl",
            "type": "forwarder",
            "text": "They get angry and pick you up and put you outside the back door.",
            "goto": "garden"
        },{
            "name": "garden",
            "type": "decision",
            "text": "As you expore the garden you find a secret door in the fence that has a lock on it.",
            "opts": [
                {
                    "requires": "key",
                    "text": "Open the door with the key you found on the trampolene",
                    "goto": "fence"
                },
                {
                    "text": "You can see a trampole which you could go and jump on.",
                    "goto": "trampolene"
                }
            ]
        },{
            "name": "grass",
            "type": "forwarder",
            "text": "You land prefectly on the grass and decide to explore the garden.",
            "goto": "garden"
        },{
            "name": "defeat",
            "type": "forwarder",
            "text": "The grown up doesn't seem angry.  So you decide to try and win them over by being cute",
            "goto": "cute"
        },{
            "name": "fence",
            "type": "decision",
            "text": "You open the fence door and you find a blue glowing pad with a three cat faces on it and a diagram of trees and a house.",
            "opts": [
                {
                    "text": "You stand on the pad with your paw.",
                    "goto": "chaper 2"
                },
                {
                    "text": "It looks a bit scary, so you run out and into the garage.",
                    "goto": "garage"
                }
            ]
        },{
            "name": "upstairs",
            "type": "decision",
            "text": "You go into another upstairs room and find a secret chest.  It has a keypad on it.",
            "opts": [
                {
                    "requires": "code - 51 63 142 62 45",
                    "text": "Type the code 51 63 142 62 45 on the keypad",
                    "goto": "powerup box"
                },
                {
                    "text": "Press some keys randomly the box buzzes and shoots out some fireworks which scare you and you run out the window.",
                    "goto": "grass"
                }
            ]
        },{
            "name": "powerup box",
            "type": "forwarder",
            "text": "The box opnens and you find a set of wings you want to test your wings so you fly into the garden",
            "goto": "garden"
        },{
            "name": "garage",
            "type": "decision",
            "text": "you're in the garage and dont know what to do. so you decide to...",
            "opts": [
                {
                    "text": "go out of the garage, into the garden",
                    "goto": "garden"
                },
                {
                    "text": "go out of the garage, in the hows and under the bed",
                    "goto": "bed explore"
                }
            ]
        }

    ]
}